Revit 2027 API
ParameterTypeId.ScaleFactorParam Property
 "Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ScaleFactorParam { get; }
Public Shared ReadOnly Property ScaleFactorParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ScaleFactorParam {
	ForgeTypeId^ get ();
}
static member ScaleFactorParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace